CaseDir/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 2.5e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}



 // for the non bouyant case both fluid has the same density and nu 
air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ]1.6256e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.122;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.073;


// ************************************************************************* //
