CaseDir/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];


internalField   nonuniform List<scalar> 
199712
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    rightWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    leftWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontWall
    {
        type            empty;
    }
    backWall
    {
        type            empty;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    atmosphere
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
